//TODO  продебажить редьюсер( почекать то, что не сам писал)+++
//TODO созвониться по переписнаию колонок на ключ-значение+++
//TODO Удаление\редактирование карточки+++
//TODO редактирование должнго быть универсальным+++

//TODO 1 карточка модалка
//TODO редактировать заголовок в модалке, создание\редактирование описания
//TODO чеклист
//TODO поправить editor, добавить лоадер пока не придет ответ от сервера

//TODO передавать всю карточку на сервер, а там уже менять
//TODO Исправить верстку едитора




//TODO исправить весь header  на title везде
//TODO убрать все any
//TODO переименовать action creators
//TODO поправить все типы
//TODO редактирование заголовка модалки и карты
//TODO описание редактирование и доделать
//TODO отрисовка чеклиста
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO
//TODO