//  продебажить редьюсер( почекать то, что не сам писал)+++
//  созвониться по переписнаию колонок на ключ-значение+++
//  Удаление\редактирование карточки+++
//  редактирование должнго быть универсальным+++

// TODO 1 карточка модалка
// TODO редактировать заголовок в модалке, создание\редактирование описания
// TODO чеклист
// TODO поправить editor, добавить лоадер пока не придет ответ от сервера

// TODO передавать всю карточку на сервер, а там уже менять
// TODO Исправить верстку едитора

// исправить весь header  на title везде +++
// убрать все any+++
// переименовать action creators +++
// поправить все типы +++
// TODO редактирование заголовка модалки и карты
// TODO описание редактирование и доделать
// отрисовка чеклиста +++
// повесить useclickOutside внутри компонента Editor +++
// TODO поправить лоадер в Editor
// типизировать useClickOutside
// TODO сделать индексный файл, в который импортировать все хуки
// TODO поправить datapicker
// TODO изменить default value у editor
// TODO сделать проверку на удаление чего-либо
// TODO error boundary создать компонент которым обернуть другие которые могут закрашиться
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO
// TODO